import freeing from '../img/50331859-2357765.jpeg'
import zdobich from '../img/zdobich.jpg'
import tor4 from '../img/tor4.jpg'
import matrix4 from '../img/matrix4.jpg'
import fastTrain from '../img/fastTrain.jpg'
import inter from '../img/inter.jpg'
import allAndAlways from '../img/allAndAlways.jpg'
import ghostCristmas from '../img/ghostCristmas.jpg'
import Meters1 from '../img/3Meters1.jpg'
import mrec from '../img/mrec.jpg'
import duna from '../img/duna.jpg'
import shark from '../img/shark.jpg'



export interface film {
    id: any,
    title: string,
    year: string,
    country: string,
    genres: string[],
    date: any,
    rating: number,
    img: string,
    describe: string
  }

  export interface user {
    id:number,
    name: string,
    email:string,
    password:string,
    adminStatus:boolean,
    userImg: string,
    favFilms: any[]
  }

  export interface userIn{
    userIn:user
  }

  export const userBasicImg ='https://img.myloview.fr/stickers/profil-icone-vecteur-avatar-personne-utilisateur-masculin-dans-l-illustration-de-pictogramme-glyphe-couleur-plat-700-121123314.jpg'

  export const users:user[]=[
    {id:1, name:'user', email:'user1@ukr.net', password:'123', adminStatus:false, userImg:userBasicImg,favFilms:[]},
{id:2, name:'admin', email:'admin@gmail.com', password:'123', adminStatus:true, userImg:userBasicImg,favFilms:
[]},
  ]

export const dataFilms:film[] = [
    {id: 1, title:'Аватар 2', year:'2021', country:'США', 
    genres:['Фільми', 'Новинки', 'Боєвик', 'Пригоди', 'Фантастика', 'Фентезі'], date:new Date(2021,11,15),
    rating:4.5, img: 'https://kinogo.biz/uploads/mini/minifull/f14/1633458553-554091003.webp', describe:'В прошлом Джейк Салли был опытнейшим солдатом, но травма вынуждает его расстаться с боевыми товарищами раз и навсегда. Но неожиданно герой становится участником эксперимента, что позволяет ему получить собственного аватара и начать новую жизнь. Узнав, что Пандоре грозит серьезная опасность, Джейк возглавляет оборону планеты. Также к герою присоединяются его друзья и возлюбленная Нейтири. Вскоре на поверхность планеты прибывают вооруженные до зубов люди, готовые пойти на все, лишь бы местные обитатели отдали им все свои бесценные ресурсы. Отступать некуда, а земные ученые продолжают создавать одно страшное оружие за другим, стремясь превратить Пандору в очередную колонию. Однако ради защиты своих людей Джейк готов пойти на любые жертвы, а потому землянам придется пролить немало крови или же окончательно отказаться от операции.'
},
{id: 2, title:'Звільнення', year:'2022', country:'США', 
    genres:['Фільми', 'Новинки', 'Боєвик', 'Трилери'], date:new Date(2022,1,1),
    rating:4.5, img:freeing, describe:'Америка, 1860-е годы. Еще совсем недавно главный герой был обычным рабом, вынужденным трудиться на плантациях жестокого хозяина. Этот человек нещадно наказывал его за малейшую ошибку и относился как к личной собственности. И однажды доведенный до отчаянья раб решает совершить побег, оставив позади все то, что не давало ему никаких шансов на нормальное будущее. Так беглец оказывается на бесконечных болотах Луизианы, кишащих опасностями и ловушками. В это же время разъяренный хозяин объявляет на беглого раба охоту. Возвращаться назад нельзя ни в коем случае, а всякое промедление может стоить самой жизни. Сможет ли обычный раб найти безопасное место и, наконец, объявить себя свободным человеком? Или его вновь вернут назад на плантацию и показательно казнят в назидание другим несчастным? Грядет безумная история, сотканная из мужества, героизма и неожиданных поворотов судьбы'
},
{id: 3, title:'Здобич', year:'2022', country:'США', 
    genres:['Фільми', 'Пригоди', 'Трилери'], date:new Date(2022,6,21),
    rating:4.3, img:zdobich, describe:'18 століття, в в центрі сюжету - жінка з індіанського племені команчі, яка хоче утвердитись у чоловічому світі та довести, що вона є справжнім воїном. У звязку із прибуттям на Землю позаземного Хижака у неї випадає шанс проявити себе.'
},
{id: 4, title:'Тор: Любов і Грім', year:'2022', country:'США', 
genres:['Екшн', 'Пригоди', 'Фантастика', 'Фентезі'], date:new Date(2022,6,6),
rating:3.4, img:tor4, describe:'Супергеройський блокбастер Тайки Вайтіті про могутнього бога грому та блискавки Тора, який протистоїть новій загрозі – Горру Вбивці Богів. Для боротьби з ним Тор обєднує зусилля з друзями з небесного Азгарду та командою Вартових Галактики. Крім того, повертається його земне кохання Джейн Фостер, у якої з собою є кілька неймовірних сюрпризів.'
},
{id: 5, title:'Матриця 4. Воскресіння', year:'2021', country:'США', 
    genres:['Екшн','Комедія','Трилери','Романтичні'], date:new Date(2021,11,22),
    rating:2.9, img:matrix4, describe:'Мало хто з сучасних людей замислюється над сенсом свого існування. А що якщо реальність зовсім не та, якою здається? Що якщо все навколо - це всього лише штучно створена ілюзія? Багато років тому Томас Андерсон особисто в цьому переконався. Страшна таємниця відкрилася йому зовсім випадково. Він був звичайним чоловіком, жив як всі, працював в офісі, і якби не його хобі, то Томас так і прожив усе своє життя в щасливому невіданні. Вся справа в тому, що Томас захоплювався компютерами, і після роботи він перетворювався на справжнісінького хакера на прізвисько Нео. Нишпорячи безкінечними просторами віртуальної мережі, Нео випадково нарветься на Матрицю. Томас не відразу зрозумів, що саме відбувається насправді. Але зовсім скоро в його житті зявилися люди, які допоможуть йому в усьому розібратися. Ось уже довгий час людство було поневолене штучним інтелектом - Матрицею. Система існувала тільки за рахунок людей, підживлюючи їх життєвою силою. А в цей час люди перебували в особливому стані і бачили сни, які їх мозок і сприймав за реальність. Боротьба за людську свободу триває вже досить давно, але дуже скоро перевага може виявитися на стороні людей. І все завдяки новому вірусу, який вбиває машин. Нас чекає продовження легендарної трилогії, яке обіцяє не знецінити події минулих фільмів та при цьому розказати що ж сталось після перемоги Нео над Матрицею.'
},
{id: 6, title:'Швидкісний поїзд', year:'2022', country:'Японія, США', 
    genres:['Екшн','Комедія','Кримінал'], date:new Date(2022,7,5),
    rating:4, img:fastTrain, describe:'Події відбуваються в поїзді, що рухається маршрутом Токіо-Моріока. За вікном з шаленою швидкістю пролітають японські міста. На шляху кілька короткочасних зупинок. Серед пасажирів опинилися пятеро найманих убивць. Хто зібрав їх у одному місці? Кожен із них професіонал у смертельному ремеслі, хоч і використовують вони різні методи. Потяг із вбивцями мчить, а по дорозі герої зясовують, що завдання їм дали різні замовники, але місія у них однакова – стовідсоткове знищення цілі. Герої не знають, чи доїдуть вони до пункту призначення живим. Кожному доведеться розправитися із суперником. Але персонажів, що вижили, і прибулих на кінцеву станцію чекають нові секрети.'
},
{id: 7, title:'Інтерстеллар', year:'2014', country:'США, Велика Британія', 
    genres:['Пригоди','Драми','Фантастика'], date:new Date(2014,9,6),
    rating:4.3, img:inter, describe:'В недалекому майбутньому техногенній людській цивілізації прийшов кінець. Землю вразили посухи, які занапастили більшу частину врожаїв. Залишки зернових пожерли бактерії, піщані бурі знищили родючий шар ґрунту. Держави зникли, людство деградувало до сільських комун, розкиданих по Землі - але навіть їх ледь могла прогодувати висохла планета.Фермером довелося стати і головному герою фільму «Інтерстеллар» Куперу. Колишній пілот-випробувач НАСА займався сільським господарством разом з тестем, сином і дочкою. Одного разу Купер зауважив якусь особливість: ферму покривали невідомі радіохвилі. Відшукавши їх джерело, Купер виявив секретну лабораторію НАСА. Там він зустрів професора Амелію Бранд.Професор розповіла Куперу про теорію червоточини, в якій криється порятунок людства. Одна з червоточин знаходиться на орбіті Сатурна і, можливо, веде до світів, придатних для життя. Група Бранд уже побудувала Інтерстеллар - корабель для польоту до Сатурна. Купер стає пілотом експериментального корабля.'
},
{id: 8, title:'Все завжди і водночас', year:'2022', country:'США', 
    genres:['Екшн','Комедія','Пригоди','Фантастика','Фентезі'], date:new Date(2022,2,11),
    rating:2.7, img:allAndAlways, describe:'У центрі сюжету фільму «Все завжди і водночас» - Евелін Ван, вже не молодого віку китайська іммігрантка, яка намагається жити тихим і спокійним життям. Але її реальність різко змінюється після того, як вона зазнає серйозного допиту. В якийсь момент, Евелін починає усвідомлювати, що світ може бути не таким, яким вона собі його уявляла до сьогоднішнього моменту.Героїня фільму «Все завжди і водночас» відкриває в собі вміння дивитися на два світи одночасно. Незабаром після цього пані Ван дізнається, що перебуває в дивному стані, коли вона може бачити себе в різних перспективах, немов вона перебуває у мультивсесвіті. Коли ці думки одержують своє підтвердження, героїня розуміє, що ця можливість дозволяє їй одночасно існувати у багатьох світах. Це відкриває перед нею нові перспективи. Але можливості, що відкрилися, приховують чимало небезпек.У всього, що відбувається, є причина. Евелін має докопатися до правди. Істина може виявитися шокуючою.'
},
{id: 9, title:'Дух Різдва', year:'2022', country:'США', 
    genres:['Комедія','Музичні','Сімейні'], date:new Date(2022,10,11),
    rating:3.3, img:ghostCristmas, describe:'У центрі уваги життєва історія скупого та самотнього чоловіка. Він не любив дорослих та ненавидів дітей. Його дратували посмішки, дзвінкий сміх та радість на обличчях оточуючих. Шумна і химерна дітвора боялася навіть поглянути у бік злісного старого. Можна лише уявити, наскільки озлоблений і буркотливий він був у період зимових свят через їх безтурботну метушню. Герой фільму «Дух Різдва» засуджував зайві витрати на, як він вважав, непотрібні подарунки та багатолюдні гуляння. Одного разу вночі до нього зявилась незвичайна сутність, що представилася різдвяним духом. Вона тягне за собою, обіцяючи відкрити таємничу завісу майбутнього. Ця подія стає початком захоплюючої подорожі, наскрізь просоченої чаклунством та магією. Хто знає, може після повернення додому сноб зміниться і нарешті зрозуміє, що таке добро та щастя?'
},
{id: 10, title:'Три метри над рівнем неба', year:'2010', country:'Іспанія', 
    genres:['Драми' , 'Романтичні'], date:new Date(2010,11,3),
    rating:3.5, img:Meters1, describe:'Картина оповідає про те, наскільки непередбачувані людські долі і як складно контролювати дивовижне і загадкове почуття під назвою «любов». У центрі подій мила і невинна дівчина із забезпеченої і добропорядної родини - Бабі. Волею випадку вона знайомиться зі своєю повною протилежністю - Аче. Він відчайдушний шибайголова, безвідповідальний і імпульсивний егоїст, люблячий вуличні гонки і небезпечні пригоди. Його світ не такий як її, Аче звик жити одним днем і думати тільки про себе. Але його несподіване знайомство з Бабі ставить все з ніг на голову. Любов змушує егоїстичного шибеника подивитися на світ новими очима. Виявляється, що людське життя це не тільки низка пригод, одноденних інтрижок і імпульсивних рішень. Бабі вчить Аче відповідальності, чесності та турботи про оточуючих. Любов допомагає головному герою змінитися. Ось тільки ворожий світ Бабі не приймає Аче. А стати краще і забути про своє минуле егоїстичне життя не так вже й просто. Чи зможе велика сила любові перемогти соціальну нерівність? Чи зуміє Аче змінити себе або тендітна любов поступиться першим же серйозним випробуванням? Дізнаєтеся, подивившись "Три метри над рівнем неба".'
},
{id: 11, title:'Мрець', year:'1995', country:'США, Німеччина, Японія  ', 
    genres:['Драми' , 'Фентезі' , 'Вестерн'], date:new Date(1995,11,23),
    rating:4.0, img:mrec, describe:'Подорож довжиною у життя та подорож довжиною у смерть – метафізичний вестерн від Джима Джармуша.Скромний бухгалтер Вільям Блейк мчить прямісінько на Дикий Захід, де на нього не чекає нічого хорошого. Навіть незнайомець у поїзді пророкує йому швидку смерть. Але Блейк сповнений надій, після смерті батьків він сподівається на місце, яке йому обіцяли на металургійному комбінаті. Але варто Блейку приїхати в місто Машин, як гнітюче відчуття близькості смерті лише загострюється. Блейк так несхожий на інших городян, місце його вже віддане іншому, а далі, без грошей і надії на майбутнє, Блейк заходить до місцевого бару, а наступного ранку за ним уже полюють троє головорізів директора комбінату. І Блейк відправляється у подорож, назустріч просторим та диким американським землям та самому собі.'
},
{id: 12, title:'Дюна', year:'2021', country:'США, Канада', 
    genres:['Екшн' , 'Пригоди' , 'Драми' , 'Фантастика' , 'Фентезі'], date:new Date(2021,9,22),
    rating:4.25, img:duna, describe:'Дім Атрідів підправляється з рідної планети Калладна на планету Аракіс, що представляє собою пустелю з суворими умовами для виживання і небезпечними істотами, але саме ці володіння дозволяють Аракісу бути наймогутнішим місцем у Всесвіті. На цій планеті видобувають цінний ресурс, званий «меланж». Це найдорожча речовина з усіх існуючих, оскільки вона розкриває особливі здібності людини. Ті, хто володіє пряністю, диктують умови всім мешканцям Всесвіту. Герой фільму «Дюна» є спадкоємцем знаменитого дому. Зараз Пол готується стати повноправним наступником. Він знає, що навколо їх сімї постійно зріють змови з метою позбавити їх могутності. Але хлопець не очікував, що вступити в протистояння і боротьбу за владу йому доведеться так скоро. На нього чекають серйозні і небезпечні випробування, також не раз життю Пола загрожуватиме смертельна небезпека, а потім спадкоємець дізнається страшну таємницю, що зберігає його планета.'
},
{id: 13, title:'Щелепи', year:'1975', country:'США', 
genres:['Пригоди' , 'Драми' , 'Трилери' , 'Жахи'], date:new Date(1975,7,6),
rating:4.0, img:shark, describe:'«Щелепи» - культовий оскароносний фільм жахів, екранізація знаменитого роману Пітера Бенчлі про білу акулу-людоїдку.Курортний острівець Еміті, розпал туристичного сезону. Місцеві поліцейські виявляють на пляжі понівечене тіло дівчини, яка купалася в морі напередодні вночі. Нещасна стала жертвою величезної білої акули, що промишляля коло самого берега. Шериф Мартін Броуді, який знайшов труп, вимагає закрити пляж, оповістити жителів і почати вилов небезпечної тварюки, однак мер і бізнесмени містечка категорично заперечують. Закриття пляжу принесе солідні збитки власникам прибережних готелів, тому причину смерті туристки вирішують не розголошувати.Між тим агресивна акула-вбивця залишати води Еміті не збирається. Черговими жертвами монстра стають необережні відпочиваючі і самотні рибалки на маленьких човнах. Вимушений визнати помилку мер запрошує в місто експерта-океанографа Метта Хупера і обіцяє рибалкам за упіймання хижачки велику винагороду. Полювання на акулу-людожерку починається, проте мисливці поступово стають здобиччю.'
},
]
